# ფუნქციები, რომლებიც ერთი მონაცემთა ტიპიდან გადაყვათ მეორეში 
# ამ შემთხვევაში int(),str() და float() ქვიათ მექანიკური მონაცემთა ტიპის შეცვლა
# მექანიკურში ვგულისხმობ იმას რომ ჩვენ ჩვენი ხელით გარდავქმნით ერთი ტიპიდან მეორეში

# int() ეს ფუნქცია გვეხმარება იმით, რომ შეგვიძლია მნიშვნელობა გარდავქმნათ ინტეჯერად ანუ მთელ რიცხვად.
print(int(6.4))
print(int("12") + 6)

# float() ეს ფუნქცია გვეხმარება იმით, რომ შეგვიძლია მნიშვნელობა გარდავქმნათ ათწილად რიცხვად.
print(float("6.7"))
print(float(43))

# str() ეს ფუნქცია გვეხმარება იმით, რომ შეგვიძლია ნებისმიერი მნიშვნელობა გარდავქმნათ სტრინგად.
print(str(13) + "8")
print(str(6.1) + "6")

# type() ეს ფუნქცია გვეხმარება იმით, რომ შეგვიძლია გავიგოთ კონკრეტული მნიშვნელობა რა ტიპის არის.
print(type(6.1))
print(type(10))
print(type("sandro"))